# Моделирование работы Машины Тьюринга.
def main():
    # Начальное состояние Машины Тьюринга
    global tape
    directions = {'R': 1, 'L': -1, 'N': 0}
    state = 'q0'
    i = 0
    while state != 'q8':
        tape[i], direction, state = table[state][tape[i]]
        i += directions[direction]
    return tape


if __name__ == '__main__':
    # Считываем ленту.
    tape = list(input())
    # Таблица состояний Машины Тьюринга.
    table = {
        # Поиск цифры после знака.
        'q0': {
            ' ': (' ', 'R', 'q0'), '0': ('0', 'R', 'q0'),
            '1': ('1', 'R', 'q0'), '2': ('2', 'R', 'q0'),
            '+': ('+', 'R', 'q1'), '-': ('-', 'R', 'q1')
        },
        # Запоминаем число.
        'q1': {
            '0': ('0', 'N', 'q8'), '1': ('1', 'L', 'q2'),
            '2': ('2', 'L', 'q4')
        },
        # +1 или смена на -1 если будет знак "-".
        'q2': {  
            ' ': ('1', 'N', 'q8'), '0': ('1', 'N', 'q8'),
            '1': ('2', 'N', 'q8'), '2': ('0', 'L', 'q2'),
            '+': ('+', 'L', 'q2'), '-': ('-', 'L', 'q3')
        },
        # -1.
        'q3': {
            '0': ('2', 'L', 'q3'), '1': ('0', 'L', 'q6'),
            '2': ('1', 'N', 'q8')
        },
        # +2 или смена на -2, если будет знак "-".
        'q4': {
            ' ': ('2', 'N', 'q8'), '0': ('2', 'N', 'q8'),
            '1': ('0', 'L', 'q2'), '2': ('1', 'L', 'q2'),
            '+': ('+', 'L', 'q4'), '-': ('-', 'L', 'q5')
        },
        # -2.
        'q5': {
            '0': ('1', 'L', 'q3'), '1': ('2', 'L', 'q3'),
            '2': ('0', 'L', 'q6')
        },
        # Проверка на наличие ведущего нуля.
        'q6': {
            ' ': (' ', 'R', 'q7'), '0': ('0', 'N', 'q8'),
            '1': ('1', 'N', 'q8'), '2': ('2', 'N', 'q8')
        },
        # Удаление ведущего нуля, если это не единственная цифра.
        'q7': {
            ' ': ('0', 'N', 'q8'), '0': (' ', 'R', 'q7'),
            '1': ('1', 'N', 'q8'), '2': ('2', 'N', 'q8'),
            '+': ('+', 'L', 'q7'), '-': ('-', 'L', 'q7')
        }
    }
    print(''.join(main()))

